#pragma once

#ifndef _MODULE_FILE_H // Блокируем повторное включение этого модуля
#define _MODULE_FILE_H
//******************************************************************************
// Секция include
//******************************************************************************
#include "main.h"
//******************************************************************************
// Секция определения констант
//******************************************************************************
#define DEFAULT_VALUE_GET_FILE 0x0FFFFFFF

//******************************************************************************
// Секция определения типов
//******************************************************************************

//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
BOOL OpenFileDefault(struct UserParameters_DType& param);
void SaveFileDefault(const struct UserParameters_DType param);
LPTSTR OpenFileUser(struct UserParameters_DType& param);
LPTSTR SaveFileUser(const struct UserParameters_DType param);
LPTSTR ExtractFilePath(LPCTSTR FileName, LPTSTR buf);
//******************************************************************************
// Секция определения макросов
//******************************************************************************

#endif
//******************************************************************************
// ENF OF FILE
//******************************************************************************