#pragma once
#ifndef __KEY_HOOK_H // Блокируем повторное включение этого модуля
#define __KEY_HOOK_H
//******************************************************************************
// Секция include
//******************************************************************************
#include "main.h"
#include <Windows.h>
//******************************************************************************
// Секция определения констант
//******************************************************************************

//******************************************************************************
// Секция определения типов
//******************************************************************************

//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************
extern void (*CallbackKeyHook)(BOOL fLeft, BOOL fRight, BOOL fUp, BOOL fDown, BOOL fAttack);
extern void (*ESCInterrupt)(void);
//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
LRESULT WINAPI SetKeyboardHook(HWND hwndMain, UINT uMsg, WPARAM wParam, LPARAM lParam);
LRESULT WINAPI DelKeyboardHook(HWND hwndMain, UINT uMsg, WPARAM wParam, LPARAM lParam);
//******************************************************************************
// Секция определения макросов
//******************************************************************************
#endif
//******************************************************************************
// ENF OF FILE
//******************************************************************************