#pragma once
#ifndef _MOUSE_HOOK_H // Блокируем повторное включение этого модуля
#define _MOUSE_HOOK_H
//******************************************************************************
// Секция include
//******************************************************************************
#include <windows.h>
#include <strsafe.h>
//******************************************************************************
// Секция определения констант
//******************************************************************************

//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef struct _MYHOOKDATA
{
    int nType;
    HOOKPROC hkprc;
    HHOOK hhook;
} MYHOOKDATA;

struct MOUSE_STATUStypedef {
	INT xPosition;
	INT yPosition;
	BOOL LeftButton;
	BOOL RightButoon;
};
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
UCHAR MouseProcess_init(void);
UCHAR MouseProcess_deinit(void);
UCHAR MouseProcess_start(HWND hwndMain);
UCHAR MouseProcess_stop(void);
extern void (*MouseHookInterruptProcessing)(INT lr, INT ud, BOOL fAttack);
//******************************************************************************
// Секция определения макросов
//******************************************************************************

#endif
//******************************************************************************
// ENF OF FILE
//******************************************************************************
