#pragma once
#ifndef _VIDEO_H264_DECODE_SEND_H // Ѕлокируем повторное включение этого модул€
#define _VIDEO_H264_DECODE_SEND_H
//******************************************************************************
// Section include
//******************************************************************************
#include "main.h"
#include <Windows.h>
//******************************************************************************
// Constants
//******************************************************************************

//******************************************************************************
// Type
//******************************************************************************
typedef struct {
    unsigned char* data;
    int size;
}RTPData_DType;

typedef struct 
{   
    struct
    {
        unsigned char V:2;               //¬ерси€
        unsigned char P:1;               //заполнение
        unsigned char X:1;               //расширение
        unsigned char CC:4;              //количество CSRC

        unsigned char M:1;               //маркер (флаг последнего пакета AU),
        unsigned char PT:7;              //полезна€ нагрузка (тип данных носител€ полезной нагрузки RTP, H264 = 96)

        unsigned short sequence_number;  //ѕор€дковый номер: пор€дковый номер пакета RTP, увеличенный на 1.
        unsigned int time_stamp;         //временна€ метка выборки медиа. 
        unsigned int SSRC;               //ѕакет данных имеет одинаковое происхождение.
    };
}RTPHeader_DType;
//******************************************************************************
// Global var
//******************************************************************************

//******************************************************************************
// Local function prototype
//******************************************************************************
UCHAR rtp_H264_recive_init(void);
UCHAR RTPStop(void);
//******************************************************************************
// Macros
//******************************************************************************
#define BYTE2_SWAP(X)   ((((short)(X) & 0xff00) >> 8) |(((short)(X) & 0x00ff) << 8))
#endif
//******************************************************************************
// ENF OF FILE
//******************************************************************************