#pragma once

#ifndef _WINDOW_CONTROL_OPTION_H // Блокируем повторное включение этого модуля
#define _WINDOW_CONTROL_OPTION_H
//******************************************************************************
// Секция include
//******************************************************************************

#include "GUIDefinition.h"
#include "main.h"
//******************************************************************************
// Секция определения констант
//******************************************************************************
#define LINE_SPACE_CONTROL_OPTION	30

#define COPT_ZERO_POSITION	0
#define COPT_NO_LIMIT	1

#define COPT_EDIT_M1_ROTATION_SPEED	2
#define COPT_EDIT_M2_ROTATION_SPEED	3
#define COPT_EDIT_M1_REDUCTION_RATIO	4
#define COPT_EDIT_M2_REDUCTION_RATIO	5

#define COPT_MOUSE_COEFFICIENT	6

#define COPT_TIMER 2028
//******************************************************************************
// Секция определения типов
//******************************************************************************

//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
int WINAPI CreateWindow_ControlOption(HINSTANCE hInst, HWND parent);
//******************************************************************************
// Секция определения макросов
//******************************************************************************
#endif
//******************************************************************************
// ENF OF FILE
//******************************************************************************